Autodesk.Revit.DB.ProjectPosition.#ctor(Autodesk.Revit.DB.ProjectPosition)
Creates a copy of the ProjectPosition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null